/*
- 컴퓨터언어 -> 기계어(어셈블리어), 2진법(0, 1)(전기적 신호), 취업 후 재진학 => 논리회로
PC -> 윈도우(WINAPI)
모바일 -> 안드로이드, ios
C++ = 고언어, 컴파일러 사용.
==================================
C++ 을 배워야하는이유
1. 활용 -> 다른 언어에 접근하기 쉬움. 문법이 방대함.
2. 빠름 (C# 은 JVM, 닷넷프레임워크 갔다가, 메모리 관리해줌,
C++은 os로 바로 감. 또 언메니지먼트 언어임. 메모리 관리로 디버깅해야함.)
WINAPI 쓰면 다이랙트 엑스에서 쉬움. 또 CPU 에서 GPU 를 쓰기위한 것이 다이랙트 엑스임
====================================================================================
꼭 복습하기. 이유는 5일만에 끝나는 것이기 때문에
F11, F12, F5 등의 키, 그리고 조사식과 디스에셈블리 창에 익숙해지기
*/

#include <iostream>
using namespace std;

int main() {
	std::cout << "C++" << std::endl;	// std 이름공간 :: 범위지정자, cout과 endl은 ostream 클래스의 객체,
}